jmeter/tests/spring-petclinic/jmeter.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan">
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
    </TestPlan>
    <hashTree>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Load Test">
        <intProp name="ThreadGroup.num_threads">50</intProp>
        <intProp name="ThreadGroup.ramp_time">1</intProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller">
          <stringProp name="LoopController.loops">15000</stringProp>
          <boolProp name="LoopController.continue_forever">false</boolProp>
        </elementProp>
      </ThreadGroup>
      <hashTree>
        <kg.apc.jmeter.jmxmon.JMXMonCollector guiclass="kg.apc.jmeter.vizualizers.JMXMonGui" testclass="kg.apc.jmeter.jmxmon.JMXMonCollector" testname="JVM Metrics Collector">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/rawJvmMetrics.csv</stringProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
          <collectionProp name="samplers">
            <collectionProp name="611264212">
              <stringProp name="414035835">HeapCommittedBytes</stringProp>
              <stringProp name="797800710">service:jmx:rmi:///jndi/rmi://localhost:1234/jmxrmi</stringProp>
              <stringProp name="-1508861468">java.lang:type=Memory</stringProp>
              <stringProp name="-687755404">HeapMemoryUsage</stringProp>
              <stringProp name="-1491142788">committed</stringProp>
              <stringProp name="1237">false</stringProp>
              <stringProp name="1237">false</stringProp>
            </collectionProp>
            <collectionProp name="-1025910180">
              <stringProp name="-621928958">HeapUsedBytes</stringProp>
              <stringProp name="797800710">service:jmx:rmi:///jndi/rmi://localhost:1234/jmxrmi</stringProp>
              <stringProp reference="../../collectionProp/stringProp[3]"/>
              <stringProp reference="../../collectionProp/stringProp[4]"/>
              <stringProp name="-1508861468">java.lang:type=Memory</stringProp>
              <stringProp name="-687755404">HeapMemoryUsage</stringProp>
              <stringProp name="3599293">used</stringProp>
              <stringProp name="1237">false</stringProp>
              <stringProp name="1237">false</stringProp>
            </collectionProp>
            <collectionProp name="-664477719">
              <stringProp name="-990453216">G1Young_CollectionCount</stringProp>
              <stringProp name="797800710">service:jmx:rmi:///jndi/rmi://localhost:1234/jmxrmi</stringProp>
              <stringProp name="1726211187">java.lang:name=G1 Young Generation,type=GarbageCollector</stringProp>
              <stringProp name="37477617">CollectionCount</stringProp>
              <stringProp name="1237">false</stringProp>
              <stringProp name="1237">false</stringProp>
            </collectionProp>
            <collectionProp name="-1955263498">
              <stringProp name="609403780">NonHeapMemoryUsageBytes</stringProp>
              <stringProp name="797800710">service:jmx:rmi:///jndi/rmi://localhost:1234/jmxrmi</stringProp>
              <stringProp name="-1508861468">java.lang:type=Memory</stringProp>
              <stringProp name="-1580651225">NonHeapMemoryUsage</stringProp>
              <stringProp name="3599293">used</stringProp>
              <stringProp name="1237">false</stringProp>
              <stringProp name="1237">false</stringProp>
            </collectionProp>
            <collectionProp name="-1222546322">
              <stringProp name="1933416879">G1Old_CollectionCount</stringProp>
              <stringProp name="797800710">service:jmx:rmi:///jndi/rmi://localhost:1234/jmxrmi</stringProp>
              <stringProp name="1939039044">java.lang:name=G1 Old Generation,type=GarbageCollector</stringProp>
              <stringProp name="37477617">CollectionCount</stringProp>
              <stringProp name="1237">false</stringProp>
              <stringProp name="1237">false</stringProp>
            </collectionProp>
            <collectionProp name="-334254950">
              <stringProp name="-585639012">G1Young_CollectionTime</stringProp>
              <stringProp name="797800710">service:jmx:rmi:///jndi/rmi://localhost:1234/jmxrmi</stringProp>
              <stringProp name="1726211187">java.lang:name=G1 Young Generation,type=GarbageCollector</stringProp>
              <stringProp name="-691027285">CollectionTime</stringProp>
              <stringProp name="1237">false</stringProp>
              <stringProp name="1237">false</stringProp>
            </collectionProp>
            <collectionProp name="-334254950">
              <stringProp name="-585639012">G1Young_CollectionTime</stringProp>
              <stringProp name="797800710">service:jmx:rmi:///jndi/rmi://localhost:1234/jmxrmi</stringProp>
              <stringProp name="1726211187">java.lang:name=G1 Young Generation,type=GarbageCollector</stringProp>
              <stringProp name="-691027285">CollectionTime</stringProp>
              <stringProp name="1237">false</stringProp>
              <stringProp name="1237">false</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.jmxmon.JMXMonCollector>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="HTTP Request">
          <stringProp name="HTTPSampler.domain">localhost</stringProp>
          <stringProp name="HTTPSampler.port">8080</stringProp>
          <stringProp name="HTTPSampler.protocol">http</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
        </HTTPSamplerProxy>
        <hashTree/>
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
        <kg.apc.jmeter.jmxmon.JMXMonCollector guiclass="kg.apc.jmeter.vizualizers.JMXMonGui" testclass="kg.apc.jmeter.jmxmon.JMXMonCollector" testname="JMX CPU Load">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/rawCpuMetrics.csv</stringProp>
          <longProp name="interval_grouping">1000</longProp>
          <boolProp name="graph_aggregated">false</boolProp>
          <boolProp name="include_checkbox_state">false</boolProp>
          <boolProp name="exclude_checkbox_state">false</boolProp>
          <collectionProp name="samplers">
            <collectionProp name="-2040078918">
              <stringProp name="-481625761">SystemCpuLoad</stringProp>
              <stringProp name="797800710">service:jmx:rmi:///jndi/rmi://localhost:1234/jmxrmi</stringProp>
              <stringProp name="1418096973">java.lang:type=OperatingSystem</stringProp>
              <stringProp name="-481625761">SystemCpuLoad</stringProp>
              <stringProp name="1237">false</stringProp>
              <stringProp name="1237">false</stringProp>
            </collectionProp>
            <collectionProp name="-1038367142">
              <stringProp name="-101473953">ProcessCpuLoad</stringProp>
              <stringProp reference="../../collectionProp/stringProp[2]"/>
              <stringProp reference="../../collectionProp/stringProp[3]"/>
              <stringProp reference="../../collectionProp/stringProp[4]"/>
              <stringProp reference="../../collectionProp/stringProp[5]"/>
              <stringProp name="-101473953">ProcessCpuLoad</stringProp>
              <stringProp reference="../../collectionProp/stringProp[7]"/>
              <stringProp name="1237">false</stringProp>
              <stringProp name="1237">false</stringProp>
            </collectionProp>
          </collectionProp>
        </kg.apc.jmeter.jmxmon.JMXMonCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>